panda5mt/psoc63_ble_notify_rtos/psoc63_ble_notify_rtos_mainapp/GeneratedSource/cycfg_ble.h
/** The maximum supported count of HID reports for the GATT Server role */
#define CY_BLE_CONFIG_HIDSS_REPORT_COUNT                       (0x00u)
    
/** The maximum supported count of HID services for the GATT Client role */
#define CY_BLE_CONFIG_HIDSC_SERVICE_COUNT                      (0x00u)

/** The maximum supported count of HID reports for the GATT Client role */
#define CY_BLE_CONFIG_HIDSC_REPORT_COUNT                       (0x00u)

/** HIDS service indexes */


/** HIDS Report Characteristic indexes */



/* Battery Service */
/** The maximum supported count of BAS services for the GATT Server role */
#define CY_BLE_CONFIG_BASS_SERVICE_COUNT                       (0x00u)

/** The maximum supported count of BAS reports for the GATT Client role */
#define CY_BLE_CONFIG_BASC_SERVICE_COUNT                       (0x00u)

/** BAS service indexes. */


/* Environmental Sensing Service */
/** The maximum supported count of ESS characteristics for the GATT Client role */
#define CY_BLE_CONFIG_ESSC_TOTAL_CHAR_COUNT                    (0x00u)

/** The number of ESS characteristics for the GATT Server role */
#define CY_BLE_CONFIG_ESSS_TOTAL_CHAR_COUNT                    (0x00u)

/** The number of different ESS characteristics */
#define CY_BLE_CONFIG_ESS_CHAR_INST_COUNT                      (0x15u)


/* Automation IO Service */
/** The maximum supported count of AIOS characteristics for the GATT Client role */
#define CY_BLE_CONFIG_AIOSC_TOTAL_CHAR_COUNT                   (0x00u)

/** The number of AIOS characteristics for the GATT Server role */
#define CY_BLE_CONFIG_AIOSS_TOTAL_CHAR_COUNT                   (0x00u)

/** The number of different AIOS characteristics */
#define CY_BLE_CONFIG_AIOS_CHAR_INST_COUNT                     (0x03u)


/* Custom Service */
/** The maximum supported count of Custom services for the GATT Server role */
#define CY_BLE_CONFIG_CUSTOMS_SERVICE_COUNT                    (0x03u)

/** The maximum supported count of Custom services for the GATT Client role */
#define CY_BLE_CONFIG_CUSTOMC_SERVICE_COUNT                    (0x00u)

/** The size of the cy_ble_customSChar array */
#define CY_BLE_CONFIG_CUSTOMS_SERVICE_CHAR_COUNT               (0x02u)

/** The size of the cy_ble_customSDesc array */
#define CY_BLE_CONFIG_CUSTOMS_SERVICE_CHAR_DESCRIPTORS_COUNT   (0x02u)

/** The size of the cy_ble_customCChar array */
#define CY_BLE_CONFIG_CUSTOMC_SERVICE_CHAR_COUNT               (0x00u)

/** The size of the cy_ble_customCDesc array */
#define CY_BLE_CONFIG_CUSTOMC_SERVICE_CHAR_DESCRIPTORS_COUNT   (0x00u)

/** The size of the cy_ble_customCUuid128 array */
#define CY_BLE_CONFIG_CUSTOMC_UUID_128_COUNT                   (0x00u)

/** The size of the cy_ble_customUuid16 array */
#define CY_BLE_CONFIG_CUSTOMC_UUID_16_COUNT                    (0x00u)

/*
 * Below are the indexes and handles of the defined Custom Services and 
 * their characteristics.
 */
#define CY_BLE_CUSTOM_SERVICE_SERVICE_INDEX   (0x00u) /* Index of Custom Service service in the cy_ble_customSServ array */
#define CY_BLE_CUSTOM_SERVICE_CUSTOM_CHARACTERISTIC_CHAR_INDEX   (0x00u) /* Index of Custom Characteristic characteristic */
#define CY_BLE_CUSTOM_SERVICE_CUSTOM_CHARACTERISTIC_CUSTOM_DESCRIPTOR_DESC_INDEX   (0x00u) /* Index of Custom Descriptor descriptor */

#define CY_BLE_CUSTOM_NOTIFICATION_SERVICE_INDEX   (0x01u) /* Index of Custom Notification service in the cy_ble_customSServ array */
#define CY_BLE_CUSTOM_NOTIFICATION_CUSTOM_CHARACTERISTIC_CHAR_INDEX   (0x00u) /* Index of Custom Characteristic characteristic */
#define CY_BLE_CUSTOM_NOTIFICATION_CUSTOM_CHARACTERISTIC_CLIENT_CHARACTERISTIC_CONFIGURATION_DESC_INDEX   (0x00u) /* Index of Client Characteristic Configuration descriptor */

#define CY_BLE_ADVERTIZEMENT_UUID_SERVICE_INDEX   (0x02u) /* Index of Advertizement UUID service in the cy_ble_customSServ array */

#define CY_BLE_CUSTOM_SERVICE_SERVICE_HANDLE   (0x000Au) /* Handle of Custom Service service */
#define CY_BLE_CUSTOM_SERVICE_CUSTOM_CHARACTERISTIC_DECL_HANDLE   (0x000Bu) /* Handle of Custom Characteristic characteristic declaration */
#define CY_BLE_CUSTOM_SERVICE_CUSTOM_CHARACTERISTIC_CHAR_HANDLE   (0x000Cu) /* Handle of Custom Characteristic characteristic */
#define CY_BLE_CUSTOM_SERVICE_CUSTOM_CHARACTERISTIC_CUSTOM_DESCRIPTOR_DESC_HANDLE   (0x000Du) /* Handle of Custom Descriptor descriptor */

#define CY_BLE_CUSTOM_NOTIFICATION_SERVICE_HANDLE   (0x000Eu) /* Handle of Custom Notification service */
#define CY_BLE_CUSTOM_NOTIFICATION_CUSTOM_CHARACTERISTIC_DECL_HANDLE   (0x000Fu) /* Handle of Custom Characteristic characteristic declaration */
#define CY_BLE_CUSTOM_NOTIFICATION_CUSTOM_CHARACTERISTIC_CHAR_HANDLE   (0x0010u) /* Handle of Custom Characteristic characteristic */
#define CY_BLE_CUSTOM_NOTIFICATION_CUSTOM_CHARACTERISTIC_CLIENT_CHARACTERISTIC_CONFIGURATION_DESC_HANDLE   (0x0011u) /* Handle of Client Characteristic Configuration descriptor */

#define CY_BLE_ADVERTIZEMENT_UUID_SERVICE_HANDLE   (0x0019u) /* Handle of Advertizement UUID service */



#define CY_BLE_SECURITY_CONFIGURATION_0_INDEX   (0x00u)
#define CY_BLE_ADV_PKT_0_INDEXFLAGS   (0x00u)
#define CY_BLE_ADV_PKT_0_INDEXLOCAL_NAME   (0x03u)
#define CY_BLE_ADV_PKT_0_INDEXSERVICE_UUID_16   (0x0Cu)
#define CY_BLE_PERIPHERAL_CONFIGURATION_0_INDEX   (0x00u)


/*******************************************************************************
* Services Enable defines
*******************************************************************************/

#define CY_BLE_CUSTOM
#define CY_BLE_CUSTOM_SERVER
#define CY_BLE_DIS
#define CY_BLE_DIS_SERVER


/*******************************************************************************  
* Service indexes (SRVI)
*******************************************************************************/

typedef enum
{
    CY_BLE_SRVI_GAP,
    CY_BLE_SRVI_GATT,

    #ifdef CY_BLE_ANCS_CLIENT
    CY_BLE_SRVI_ANCS,
    #endif /* CY_BLE_ANCS_CLIENT */
    
    #ifdef CY_BLE_ANS_CLIENT
    CY_BLE_SRVI_ANS,
    #endif /* CY_BLE_ANS_CLIENT */
    
    #ifdef CY_BLE_AIOS_CLIENT
    CY_BLE_SRVI_AIOS,
    #endif /* CY_BLE_AIOS_CLIENT */
    
    #ifdef CY_BLE_BAS_CLIENT
    CY_BLE_SRVI_BAS,
    CY_BLE_SRVI_BAS_END = (uint8_t)(CY_BLE_SRVI_BAS) + CY_BLE_CONFIG_BASC_SERVICE_COUNT - 1u,
    #endif /* CY_BLE_BAS_CLIENT */
    
