panda5mt/psoc63_ble_notify_rtos/psoc63_ble_notify_rtos_mainapp/GeneratedSource/cycfg_ble.h
#ifdef CY_BLE_HRS_SERVER
extern const cy_stc_ble_hrss_t cy_ble_hrss;
extern const cy_stc_ble_hrss_config_t cy_ble_hrssConfig;
#endif /* CY_BLE_HRS_SERVER */
#ifdef CY_BLE_HRS_CLIENT
extern cy_stc_ble_hrsc_t cy_ble_hrsc[CY_BLE_GATTC_COUNT];
extern const cy_stc_ble_hrsc_config_t cy_ble_hrscConfig;
#endif /* CY_BLE_HRS_CLIENT */

#ifdef CY_BLE_HTS_SERVER
extern const cy_stc_ble_htss_t cy_ble_htss;
extern const cy_stc_ble_htss_config_t cy_ble_htssConfig;
#endif /* CY_BLE_HTS_SERVER */
#ifdef CY_BLE_HTS_CLIENT
extern cy_stc_ble_htsc_t cy_ble_htsc[CY_BLE_GATTC_COUNT];
extern const cy_stc_ble_htsc_config_t cy_ble_htscConfig;
#endif /* CY_BLE_HTS_CLIENT */

#ifdef CY_BLE_IAS_SERVER
extern const cy_stc_ble_iass_t cy_ble_iass;
extern const cy_stc_ble_iass_config_t cy_ble_iassConfig;
#endif /* CY_BLE_IAS_SERVER */
#ifdef CY_BLE_IAS_CLIENT
extern cy_stc_ble_iasc_t cy_ble_iasc[CY_BLE_GATTC_COUNT];
extern const cy_stc_ble_iasc_config_t cy_ble_iascConfig;
#endif /* CY_BLE_IAS_CLIENT */

#ifdef CY_BLE_IPS_SERVER
extern const cy_stc_ble_ipss_t cy_ble_ipss;
extern const cy_stc_ble_ipss_config_t cy_ble_ipssConfig;
#endif /* CY_BLE_IPS_SERVER */
#ifdef CY_BLE_IPS_CLIENT
extern cy_stc_ble_ipsc_t cy_ble_ipsc[CY_BLE_GATTC_COUNT];
extern const cy_stc_ble_ipsc_config_t cy_ble_ipscConfig;
#endif /* CY_BLE_IPS_CLIENT */

#ifdef CY_BLE_LLS_SERVER
extern const cy_stc_ble_llss_t cy_ble_llss;
extern const cy_stc_ble_llss_config_t cy_ble_llssConfig;
#endif /* CY_BLE_LLS_SERVER */
#ifdef CY_BLE_LLS_CLIENT
extern cy_stc_ble_llsc_t cy_ble_llsc[CY_BLE_GATTC_COUNT];
extern const cy_stc_ble_llsc_config_t cy_ble_llscConfig;
#endif /* CY_BLE_LLS_CLIENT */

#ifdef CY_BLE_LNS_SERVER
extern const cy_stc_ble_lnss_t cy_ble_lnss;
extern const cy_stc_ble_lnss_config_t cy_ble_lnssConfig;
#endif /* CY_BLE_LNS_SERVER */
#ifdef CY_BLE_LNS_CLIENT
extern cy_stc_ble_lnsc_t cy_ble_lnsc[CY_BLE_GATTC_COUNT];
extern const cy_stc_ble_lnsc_config_t cy_ble_lnscConfig;
#endif /* CY_BLE_LNS_CLIENT */

#ifdef CY_BLE_NDCS_SERVER
extern const cy_stc_ble_ndcss_t cy_ble_ndcss;
extern const cy_stc_ble_ndcss_config_t cy_ble_ndcssConfig;
#endif /* CY_BLE_NDCS_SERVER */
#ifdef CY_BLE_NDCS_CLIENT
extern cy_stc_ble_ndcsc_t cy_ble_ndcsc[CY_BLE_GATTC_COUNT];
extern const cy_stc_ble_ndcsc_config_t cy_ble_ndcscConfig;
#endif /* CY_BLE_NDCS_CLIENT */

#ifdef CY_BLE_PASS_SERVER
extern const cy_stc_ble_passs_t cy_ble_passs;
extern const cy_stc_ble_passs_config_t cy_ble_passsConfig;
#endif /* CY_BLE_PASS_SERVER */
#ifdef CY_BLE_PASS_CLIENT
extern cy_stc_ble_passc_t cy_ble_passc[CY_BLE_GATTC_COUNT];
extern const cy_stc_ble_passc_config_t cy_ble_passcConfig;
#endif /* CY_BLE_PASS_CLIENT */

#ifdef CY_BLE_PLXS_SERVER
extern const cy_stc_ble_plxss_t cy_ble_plxss;
extern const cy_stc_ble_plxss_config_t cy_ble_plxssConfig;
#endif /* CY_BLE_PLXS_SERVER */
#ifdef CY_BLE_PLXS_CLIENT
extern cy_stc_ble_plxsc_t cy_ble_plxsc[CY_BLE_GATTC_COUNT];
extern const cy_stc_ble_plxsc_config_t cy_ble_plxscConfig;
#endif /* CY_BLE_PLXS_CLIENT */

#ifdef CY_BLE_RSCS_SERVER
extern const cy_stc_ble_rscss_t cy_ble_rscss;
extern const cy_stc_ble_rscss_config_t cy_ble_rscssConfig;
#endif /* CY_BLE_RSCS_SERVER */
#ifdef CY_BLE_RSCS_CLIENT
extern cy_stc_ble_rscsc_t cy_ble_rscsc[CY_BLE_GATTC_COUNT];
extern const cy_stc_ble_rscsc_config_t cy_ble_rscscConfig;
#endif /* CY_BLE_RSCS_CLIENT */

#ifdef CY_BLE_RTUS_SERVER
extern const cy_stc_ble_rtuss_t cy_ble_rtuss;
extern const cy_stc_ble_rtuss_config_t cy_ble_rtussConfig;
#endif /* CY_BLE_RTUS_SERVER */
#ifdef CY_BLE_RTUS_CLIENT
extern cy_stc_ble_rtusc_t cy_ble_rtusc[CY_BLE_GATTC_COUNT];
extern const cy_stc_ble_rtusc_config_t cy_ble_rtuscConfig;
#endif /* CY_BLE_RTUS_CLIENT */

#ifdef CY_BLE_SCPS_SERVER
extern const cy_stc_ble_scpss_t cy_ble_scpss;
extern const cy_stc_ble_scpss_config_t cy_ble_scpssConfig;
#endif /* CY_BLE_SCPS_SERVER */
#ifdef CY_BLE_SCPS_CLIENT
extern cy_stc_ble_scpsc_t cy_ble_scpsc[CY_BLE_GATTC_COUNT];
extern const cy_stc_ble_scpsc_config_t cy_ble_scpscConfig;
#endif /* CY_BLE_SCPS_CLIENT */

#ifdef CY_BLE_TPS_SERVER
extern const cy_stc_ble_tpss_t cy_ble_tpss;
extern const cy_stc_ble_tpss_config_t cy_ble_tpssConfig;
#endif /* CY_BLE_TPS_SERVER */
#ifdef CY_BLE_TPS_CLIENT
extern cy_stc_ble_tpsc_t cy_ble_tpsc[CY_BLE_GATTC_COUNT];
extern const cy_stc_ble_tpsc_config_t cy_ble_tpscConfig;
#endif /* CY_BLE_TPS_CLIENT */

#ifdef CY_BLE_UDS_SERVER
extern const cy_stc_ble_udss_t cy_ble_udss;
extern const cy_stc_ble_udss_config_t cy_ble_udssConfig;
#endif /* CY_BLE_UDS_SERVER */
#ifdef CY_BLE_UDS_CLIENT
extern cy_stc_ble_udsc_t cy_ble_udsc[CY_BLE_GATTC_COUNT];
extern const cy_stc_ble_udsc_config_t cy_ble_udscConfig;
#endif /* CY_BLE_UDS_CLIENT */

#ifdef CY_BLE_WPTS_SERVER
extern const cy_stc_ble_wptss_t cy_ble_wptss;
extern const cy_stc_ble_wptss_config_t cy_ble_wptssConfig;
#endif /* CY_BLE_WPTS_SERVER */
#ifdef CY_BLE_WPTS_CLIENT
extern cy_stc_ble_wptsc_t cy_ble_wptsc[CY_BLE_GATTC_COUNT];
extern const cy_stc_ble_wptsc_config_t cy_ble_wptscConfig;
#endif /* CY_BLE_WPTS_CLIENT */

#ifdef CY_BLE_WSS_SERVER
extern const cy_stc_ble_wsss_t cy_ble_wsss;
extern const cy_stc_ble_wsss_config_t cy_ble_wsssConfig;
#endif /* CY_BLE_WSS_SERVER */
#ifdef CY_BLE_WSS_CLIENT
extern cy_stc_ble_wssc_t cy_ble_wssc[CY_BLE_GATTC_COUNT];
extern const cy_stc_ble_wssc_config_t cy_ble_wsscConfig;
#endif /* CY_BLE_WSS_CLIENT */

#endif /* (CY_BLE_CORE == CY_BLE_CORE_DUAL) || (CY_BLE_CORE == __CORTEX_M) */

/*
BLE_CONFIG_START
<?xml version="1.0"?>
<Configuration major="1" minor="1" device="PSoC6">
    <GeneralProperties>
        <Property id="ConnectionCount" value="1"/>
        <Property id="GapRolePeripheral" value="true"/>
        <Property id="GapRoleCentral" value="false"/>
        <Property id="GapRoleBroadcaster" value="false"/>
        <Property id="GapRoleObserver" value="false"/>
        <Property id="MtuSize" value="251"/>
    </GeneralProperties>
    <Profiles>
        <Profile name="GATT">
            <ProfileProperties>
                <Property id="ClientInstCount" value="0"/>
            </ProfileProperties>
            <ProfileRoles>
                <ProfileRole type="Server">
                    <ProfileRoleProperties>
                        <Property id="Name" value="Server"/>
                    </ProfileRoleProperties>
                    <Services>
                        <Service type="org.bluetooth.service.generic_access">
                            <ServiceProperties>
                                <Property id="EntityID" value="{d2c62fb9-fb2f-4e7b-a453-bf539f0270f1}"/>
                                <Property id="ServiceDeclaration" value="Primary"/>
                            </ServiceProperties>
                            <Characteristics>
                                <Characteristic type="org.bluetooth.characteristic.gap.device_name">
                                    <Fields>
                                        <Field>
                                            <FieldProperties>
                                                <Property id="Name" value="Name"/>
                                                <Property id="Value" value="p6xble2"/>
                                                <Property id="Format" value="f_utf8s"/>
                                                <Property id="ByteLength" value="7"/>
                                            </FieldProperties>
                                        </Field>
                                    </Fields>
                                    <Properties>
                                        <BleProperty>
                                            <Property id="PropertyType" value="Read"/>
                                            <Property id="Present" value="true"/>
                                            <Property id="Mandatory" value="true"/>
                                        </BleProperty>
                                        <BleProperty>
                                            <Property id="PropertyType" value="Write"/>
                                            <Property id="Present" value="false"/>
                                            <Property id="Mandatory" value="false"/>
                                        </BleProperty>
                                    </Properties>
                                    <Permission>
                                        <Property id="AccessPermissionRead" value="true"/>
                                        <Property id="EncryptionPermissionRead" value="NoEncryptionRequired"/>
                                        <Property id="AuthenticationPermissionRead" value="NoAuthenticationRequired"/>
                                        <Property id="AuthorizationPermissionRead" value="NoAuthorizationRequired"/>
                                        <Property id="AccessPermissionWrite" value="false"/>
                                        <Property id="EncryptionPermissionWrite" value="NoEncryptionRequired"/>
                                        <Property id="AuthenticationPermissionWrite" value="NoAuthenticationRequired"/>
                                        <Property id="AuthorizationPermissionWrite" value="NoAuthorizationRequired"/>
                                    </Permission>
                                    <Descriptors/>
                                </Characteristic>
                                <Characteristic type="org.bluetooth.characteristic.gap.appearance">
                                    <Fields>
                                        <Field>
                                            <FieldProperties>
                                                <Property id="Name" value="Category"/>
                                                <Property id="EnumValue" value="0"/>
                                                <Property id="Format" value="f_16bit"/>
                                            </FieldProperties>
                                        </Field>
                                    </Fields>
                                    <Properties>
                                        <BleProperty>
                                            <Property id="PropertyType" value="Read"/>
                                            <Property id="Present" value="true"/>
                                            <Property id="Mandatory" value="true"/>
                                        </BleProperty>
                                    </Properties>
                                    <Permission>
                                        <Property id="AccessPermissionRead" value="true"/>
                                        <Property id="EncryptionPermissionRead" value="NoEncryptionRequired"/>
                                        <Property id="AuthenticationPermissionRead" value="NoAuthenticationRequired"/>
                                        <Property id="AuthorizationPermissionRead" value="NoAuthorizationRequired"/>
                                        <Property id="AccessPermissionWrite" value="false"/>
                                        <Property id="EncryptionPermissionWrite" value="NoEncryptionRequired"/>
                                        <Property id="AuthenticationPermissionWrite" value="NoAuthenticationRequired"/>
                                        <Property id="AuthorizationPermissionWrite" value="NoAuthorizationRequired"/>
                                    </Permission>
                                    <Descriptors/>
                                </Characteristic>
                            </Characteristics>
                        </Service>
                        <Service type="org.bluetooth.service.generic_attribute">
                            <ServiceProperties>
                                <Property id="EntityID" value="{2f284aa1-cb06-4019-babb-5016b74cecaa}"/>
                                <Property id="ServiceDeclaration" value="Primary"/>
                            </ServiceProperties>
                            <Characteristics>
                                <Characteristic type="org.bluetooth.characteristic.gatt.service_changed">
                                    <Fields>
                                        <Field>
                                            <FieldProperties>
                                                <Property id="Name" value="Start of Affected Attribute Handle Range"/>
                                                <Property id="Value" value=""/>
                                                <Property id="Format" value="f_uint16"/>
                                            </FieldProperties>
                                        </Field>
                                        <Field>
                                            <FieldProperties>
                                                <Property id="Name" value="End of Affected Attribute Handle Range"/>
                                                <Property id="Value" value=""/>
                                                <Property id="Format" value="f_uint16"/>
                                            </FieldProperties>
                                        </Field>
                                    </Fields>
                                    <Properties>
                                        <BleProperty>
                                            <Property id="PropertyType" value="Indicate"/>
                                            <Property id="Present" value="true"/>
                                            <Property id="Mandatory" value="true"/>
                                        </BleProperty>
                                    </Properties>
                                    <Permission>
                                        <Property id="AccessPermissionRead" value="false"/>
                                        <Property id="EncryptionPermissionRead" value="NoEncryptionRequired"/>
                                        <Property id="AuthenticationPermissionRead" value="NoAuthenticationRequired"/>
                                        <Property id="AuthorizationPermissionRead" value="NoAuthorizationRequired"/>
                                        <Property id="AccessPermissionWrite" value="false"/>
                                        <Property id="EncryptionPermissionWrite" value="NoEncryptionRequired"/>
                                        <Property id="AuthenticationPermissionWrite" value="NoAuthenticationRequired"/>
                                        <Property id="AuthorizationPermissionWrite" value="NoAuthorizationRequired"/>
                                    </Permission>
                                    <Descriptors>
                                        <Descriptor type="org.bluetooth.descriptor.gatt.client_characteristic_configuration">
                                            <Fields>
                                                <Field>
                                                    <FieldProperties>
                                                        <Property id="Name" value="Properties"/>
                                                        <Property id="Value" value=""/>
                                                        <Property id="Format" value="f_16bit"/>
                                                    </FieldProperties>
                                                    <BitField>
                                                        <Property id="BitValue" value="0"/>
                                                        <Property id="BitValue" value="0"/>
                                                    </BitField>
                                                </Field>
                                            </Fields>
                                            <Properties>
                                                <BleProperty>
                                                    <Property id="PropertyType" value="Read"/>
                                                    <Property id="Present" value="true"/>
                                                    <Property id="Mandatory" value="true"/>
                                                </BleProperty>
                                                <BleProperty>
                                                    <Property id="PropertyType" value="Write"/>
                                                    <Property id="Present" value="true"/>
                                                    <Property id="Mandatory" value="true"/>
                                                </BleProperty>
                                            </Properties>
                                            <Permission>
                                                <Property id="AccessPermissionRead" value="true"/>
                                                <Property id="EncryptionPermissionRead" value="NoEncryptionRequired"/>
                                                <Property id="AuthenticationPermissionRead" value="NoAuthenticationRequired"/>
                                                <Property id="AuthorizationPermissionRead" value="NoAuthorizationRequired"/>
                                                <Property id="AccessPermissionWrite" value="true"/>
                                                <Property id="EncryptionPermissionWrite" value="NoEncryptionRequired"/>
                                                <Property id="AuthenticationPermissionWrite" value="NoAuthenticationRequired"/>
                                                <Property id="AuthorizationPermissionWrite" value="NoAuthorizationRequired"/>
                                            </Permission>
                                        </Descriptor>
                                    </Descriptors>
                                </Characteristic>
                            </Characteristics>
                        </Service>
                        <Service type="org.bluetooth.service.custom">
                            <ServiceProperties>
                                <Property id="EntityID" value="{67113fa8-ab0f-45af-adea-797743a77ff9}"/>
                                <Property id="DisplayName" value="Custom Service"/>
                                <Property id="UUID" value="AAAA"/>
                                <Property id="ServiceDeclaration" value="Primary"/>
                            </ServiceProperties>
                            <Characteristics>
                                <Characteristic type="org.bluetooth.characteristic.custom">
                                    <CharacteristicProperties>
                                        <Property id="DisplayName" value="Custom Characteristic"/>
                                        <Property id="UUID" value="BBBB"/>
                                    </CharacteristicProperties>
                                    <Fields>
                                        <Field>
                                            <FieldProperties>
                                                <Property id="Name" value="New field"/>
                                                <Property id="Value" value=""/>
                                                <Property id="Format" value="f_utf8s"/>
                                                <Property id="ByteLength" value="0"/>
                                            </FieldProperties>
                                        </Field>
                                    </Fields>
                                    <Properties>
                                        <BleProperty>
                                            <Property id="PropertyType" value="Read"/>
                                            <Property id="Present" value="false"/>
                                            <Property id="Mandatory" value="false"/>
                                        </BleProperty>
                                        <BleProperty>
                                            <Property id="PropertyType" value="Write"/>
                                            <Property id="Present" value="true"/>
                                            <Property id="Mandatory" value="false"/>
                                        </BleProperty>
                                        <BleProperty>
                                            <Property id="PropertyType" value="WriteWithoutResponse"/>
                                            <Property id="Present" value="false"/>
                                            <Property id="Mandatory" value="false"/>
                                        </BleProperty>
                                        <BleProperty>
                                            <Property id="PropertyType" value="AuthenticatedSignedWrites"/>
                                            <Property id="Present" value="false"/>
                                            <Property id="Mandatory" value="false"/>
                                        </BleProperty>
                                        <BleProperty>
                                            <Property id="PropertyType" value="ReliableWrite"/>
                                            <Property id="Present" value="false"/>
                                            <Property id="Mandatory" value="false"/>
                                        </BleProperty>
                                        <BleProperty>
                                            <Property id="PropertyType" value="Notify"/>
                                            <Property id="Present" value="false"/>
                                            <Property id="Mandatory" value="false"/>
                                        </BleProperty>
                                        <BleProperty>
                                            <Property id="PropertyType" value="Indicate"/>
                                            <Property id="Present" value="false"/>
                                            <Property id="Mandatory" value="false"/>
                                        </BleProperty>
                                        <BleProperty>
                                            <Property id="PropertyType" value="WritableAuxiliaries"/>
                                            <Property id="Present" value="false"/>
                                            <Property id="Mandatory" value="false"/>
                                        </BleProperty>
                                        <BleProperty>
                                            <Property id="PropertyType" value="Broadcast"/>
                                            <Property id="Present" value="false"/>
                                            <Property id="Mandatory" value="false"/>
                                        </BleProperty>
                                    </Properties>
                                    <Permission>
                                        <Property id="AccessPermissionRead" value="false"/>
                                        <Property id="EncryptionPermissionRead" value="NoEncryptionRequired"/>
                                        <Property id="AuthenticationPermissionRead" value="NoAuthenticationRequired"/>
                                        <Property id="AuthorizationPermissionRead" value="NoAuthorizationRequired"/>
                                        <Property id="AccessPermissionWrite" value="true"/>
                                        <Property id="EncryptionPermissionWrite" value="NoEncryptionRequired"/>
                                        <Property id="AuthenticationPermissionWrite" value="NoAuthenticationRequired"/>
